$(document).ready(function() {
  /// Reg-, Log- form ///
  $(".popup1").magnificPopup();
  $(".popup2").magnificPopup();
  $(".popup3").magnificPopup();
  $(".popup4").magnificPopup();
  $(".popup5").magnificPopup();
    
  /// SetCountry ///
  let fieldSearch = document.getElementById('fieldSearch'),
    blockListCountry = document.getElementById('blockListCountry'),
    listCountry = document.getElementById('listCountry'),
    elemListCountry = document.getElementsByClassName('elem-list-country'),
  fragment = document.createDocumentFragment();
  
  // ArrayOfCountries
  const arrCountry = ["Абхазия", "Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Ангуилья", "Андорра", "Антигуа и Барбуда", "Антильские острова", "Аргентина", "Армения", "Афганистан", "Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Беларусь", "Белиз", "Бельгия", "Бенин", "Бермуды", "Болгария", "Боливия", "Босния/Герцеговина", "Ботсвана", "Бразилия", "Бруней", "Буркина Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Виргинские о-ва", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гваделупа", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Гернси остров", "Гибралтар", "Гондурас", "Гонконг", "Палестина", "Гренада", "Гренландия", "Греция", "Грузия", "Конго", "Дания", "Джерси", "Джибути", "Доминикана", "Египет", "Замбия", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр", "Китай", "Колумбия", "Конго", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Кука острова", "Кыргызстан", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малайзия", "Мали", "Мальдивские острова", "Мальта", "Марокко", "Мексика", "Мозамбик", "Молдова", "Монако", "Монголия", "Мьянма", "Мэн о-в", "Намибия", "Непал", "Нигер", "Нигерия", "Нидерланды", "Никарагуа", "Новая Зеландия", "Новая Каледония", "Норвегия", "О.А.Э.", "Оман", "Пакистан", "Палау", "Панама", "Папуа Новая Гвинея", "Парагвай", "Перу", "Питкэрн", "Полинезия", "Польша", "Португалия", "Пуэрто Рико", "Реюньон", "Россия", "Руанда", "Румыния", "США", "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Святая Люсия", "Северная Корея", "Сейшеллы", "Сен-Пьер и Микелон", "Сенегал", "Сент Китс и Невис", "Сент-Винсент и Гренадины", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", "Сомали", "Судан", "Суринам", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", "Танзания", "Того", "Токелау острова", "Тонга", "Тринидад и Тобаго", "Тувалу", "Тунис", "Туркменистан", "Туркс и Кейкос", "Турция", "Уганда", "Узбекистан", "Украина", "Уоллис и Футуна острова", "Уругвай", "Фарерские острова", "Фиджи", "Филиппины", "Финляндия", "Франция", "Хорватия", "Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Южная Корея", "Южная Осетия", "Ямайка", "Япония"];
  
  // listOfCountry
  arrCountry.forEach(e => {
    let elemListCountry = document.createElement('li');
    elemListCountry.textContent = e;
    elemListCountry.className = "elem-list-country";
    fragment.appendChild(elemListCountry);
  });

  listCountry.appendChild(fragment);

  const searchCountry = () => {
    blockListCountry.style.display = (fieldSearch.value && fieldSearch.value.match(/[А-Яа-яЁё\s-]+/g)) ? 'block' : 'none';
    arrCountry.forEach((e,i) => {
      elemListCountry[i].style.display= (e.match(new RegExp(`^${fieldSearch.value}`, 'i'))) ? 'list-item' : 'none';
    });  
  },

  selectCoutnry = e => {
    if (e.target.classList.contains('elem-list-country')) {
      fieldSearch.value = e.target.textContent;
      blockListCountry.style.display='none';
    }
  };

  fieldSearch.addEventListener('input', searchCountry);
  blockListCountry.addEventListener('click', selectCoutnry);
});