<?php
if($_POST) {
	$namE = '/^film-\d\d.txt\z/';
	$path = __DIR__ ."/../data/" . $_GET['actor'];
	$conts = scandir($path);

	$i = 0;
	foreach ($conts as $node) {
    	if (preg_match($namE, $node)) {
        $last_file = $node;
    	}
	}
$file_index = (String)(((int)substr($last_file, -6, 2)) + 1);
if(strlen($file_index) == 1) {
	$file_index = "0" . $file_index;
}
$newFileName = "film-" . $file_index . ".txt";
$f = fopen("../data/" . $_GET['actor'] . "/" .$newFileName, "w");
$filmArr = [
	$_POST['film_name'],
	$_POST['film_country'],
	$_POST['film_releaseDate'],
	$_POST['quality'] == BDRip ? BDRip : HDRip,
];
$filmStr = implode(";", $filmArr);
fwrite($f,$filmStr);
fclose($f);
header('Location: ../index.php?actor=' . $_GET['actor']);
}

$countries = ["Австралія","Австрія","Азейбарджан","Албанія","Алжир","Ангола","Андорра","Антигуа і Барбуда","Аргентина",
"Афганістан","Багамські О-ви","Бангладеш","Барбадос","Бахрейн","Беліз","Бельгія","Бенін","Білорусь","Болгарія","Болівія",
"Боснія і Герцеговина","Ботсвана","Бразилія","Бруней","Буркіна-Фасо","Бурунді","Бутан","Вануату","Ватикан","Велика Британія",
"Венесуела","В'єтнам","Вірменія","Габон","Гаїті","Гамбія","Гана","Гаяна","Гватемала","Гвінея","Гвінея-Бісау","Гондурас","Гренада",
"Греція","Грузія","Данія","Джибуті","Домініка","Домініканська Республіка","Еквадор","Екваторіальна Гвінея","Еритрея","Естонія",
"Есватіні","Ефіопія","Єгипет","Ємен","Замбія","Західна Сахара","Зімбабве","Ізраїль","Індія","Індонезія","Ірак","Іран","Ірландія",
"Ісландія","Іспанія","Італія","Йорданія","Кабо-Верде","Казахстан","Камбоджа","Камерун","Канада","Катар","Кенія","Киргизстан","Китай",
"Кіпр","Кірибаті","Колумбія","Коморські О-ви","ДР Конго","Республіка Конго","Південна Корея","Північна Корея","Косово","Коста-Рика",
"Кот-д'Івуар","Куба","Кувейт","Лаос","Латвія","Лесото","Литва","Ліберія","Ліван","Лівія","Ліхтенштейн","Люксембург","Маврикій",
"Мавританія","Мадагаскар","Малаві","Малайзія","Малі","Мальдіви","Мальта","Марокко","Маршалові О-ви","Мексика","Мікронезія","Мозамбік",
"Молдова","Монако","Монголія","М'янма","Намібія","Науру","Непал","Нігер","Нігерія","Нідерланди","Нікарагуа","Німеччина","Нова Зеландія",
"Норвегія","ОАЕ","Оман","Пакистан","Палау","Палестина","Панама","Папуа Нова Гвінея","Парагвай","Перу","Південний Судан",
"Південно-Африканська Республіка","Північна Македонія","Польща","Португалія","Росія","Руанда","Румунія","Сальвадор","Самоа","Сан-Марино",
"Сан-Томе і Принсіпі","Саудівська Аравія","Сейшельські О-ви","Сенегал","Сент-Вінсент і Гренадини","Сент-Кіттс і Невіс","Сент-Люсія","Сербія",
"Сінгапур","Сирія","Словаччина","Словенія","Соломонові О-ви","Сомалі","США","Судан","Суринам","Східний Тимор","Сьєрра-Леоне","Таджикистан",
"Таїланд","Тайвань","Танзанія","Того","Тонга","Тринідад і Тобаго","Тувалу","Туніс","Туреччина","Туркменістан","Уганда","Угорщина","Узбекистан",
"Україна","Уругвай","Фіджі","Філіппіни","Фінляндія","Франція","Хорватія","Центральноафриканська Республіка","Чад","Чехія","Чилі","Чорногорія",
"Швейцарія","Швеція","Шрі-Ланка","Ямайка","Японія"];
?>
<!DOCTYPE HTML>
<html>
<head>
<title>Lab7</title>
<link rel="stylesheet" type="text/css" href="../style/edit-film-form-style.css">
</head>
<body>
<a href="../index.php">На головну</a>
<form name='create-film' method='post'>
	<div>
		<label for='film_name'>Назва: </label>
		<input type="text" name="film_name">
	</div>
	<div>
		<label for='film_country'>Країна: </label>
		<select class="form-control" name="film_country" id="film_country">
			<option disabled>Країна</option>
		<?php foreach($countries as $country): ?>
			<option value="<?=$country?>"><?=$country?></option>
		<?php endforeach; ?>
		</select>
	</div>
	<div>
		<label for='film_releaseDate'>Рік виходу: </label>
		<input type="date" name="film_releaseDate">
	</div>
	<div class = "clr">
		<input type="checkbox" name="quality" value=BDRip> Якість BDRip
	</div>
	<div>
		<input type="submit" name="ok" value="додати">
	</div>
</form>
</body>
</html>