<?php
	if ($_POST) {
		$f = fopen("../data/" . $_GET['actor'] . "/actor.txt", "w");
		$actArr = [
			$_POST['fullName'],
			$_POST['dateOfBirth'],
			$_POST['placeOfBirth']
		];
		$actStr = implode(";", $actArr);
		fwrite($f, $actStr);
		fclose($f);
		header('Location: ../index.php?actor=' . $_GET['actor']);
	}
	$actorFolder = $_GET['actor'];
	$data['actor'] = require('../data/declare-actor.php');
?>
<?php
	$countrieS = ["Австралія","Австрія","Азейбарджан","Албанія","Алжир","Ангола","Андорра","Антигуа і Барбуда","Аргентина",
"Афганістан","Багамські О-ви","Бангладеш","Барбадос","Бахрейн","Беліз","Бельгія","Бенін","Білорусь","Болгарія","Болівія",
"Боснія і Герцеговина","Ботсвана","Бразилія","Бруней","Буркіна-Фасо","Бурунді","Бутан","Вануату","Ватикан","Велика Британія",
"Венесуела","В'єтнам","Вірменія","Габон","Гаїті","Гамбія","Гана","Гаяна","Гватемала","Гвінея","Гвінея-Бісау","Гондурас","Гренада",
"Греція","Грузія","Данія","Джибуті","Домініка","Домініканська Республіка","Еквадор","Екваторіальна Гвінея","Еритрея","Естонія",
"Есватіні","Ефіопія","Єгипет","Ємен","Замбія","Західна Сахара","Зімбабве","Ізраїль","Індія","Індонезія","Ірак","Іран","Ірландія",
"Ісландія","Іспанія","Італія","Йорданія","Кабо-Верде","Казахстан","Камбоджа","Камерун","Канада","Катар","Кенія","Киргизстан","Китай",
"Кіпр","Кірибаті","Колумбія","Коморські О-ви","ДР Конго","Республіка Конго","Південна Корея","Північна Корея","Косово","Коста-Рика",
"Кот-д'Івуар","Куба","Кувейт","Лаос","Латвія","Лесото","Литва","Ліберія","Ліван","Лівія","Ліхтенштейн","Люксембург","Маврикій",
"Мавританія","Мадагаскар","Малаві","Малайзія","Малі","Мальдіви","Мальта","Марокко","Маршалові О-ви","Мексика","Мікронезія","Мозамбік",
"Молдова","Монако","Монголія","М'янма","Намібія","Науру","Непал","Нігер","Нігерія","Нідерланди","Нікарагуа","Німеччина","Нова Зеландія",
"Норвегія","ОАЕ","Оман","Пакистан","Палау","Палестина","Панама","Папуа Нова Гвінея","Парагвай","Перу","Південний Судан",
"Південно-Африканська Республіка","Північна Македонія","Польща","Португалія","Росія","Руанда","Румунія","Сальвадор","Самоа","Сан-Марино",
"Сан-Томе і Принсіпі","Саудівська Аравія","Сейшельські О-ви","Сенегал","Сент-Вінсент і Гренадини","Сент-Кіттс і Невіс","Сент-Люсія","Сербія",
"Сінгапур","Сирія","Словаччина","Словенія","Соломонові О-ви","Сомалі","США","Судан","Суринам","Східний Тимор","Сьєрра-Леоне","Таджикистан",
"Таїланд","Тайвань","Танзанія","Того","Тонга","Тринідад і Тобаго","Тувалу","Туніс","Туреччина","Туркменістан","Уганда","Угорщина","Узбекистан",
"Україна","Уругвай","Фіджі","Філіппіни","Фінляндія","Франція","Хорватія","Центральноафриканська Республіка","Чад","Чехія","Чилі","Чорногорія",
"Швейцарія","Швеція","Шрі-Ланка","Ямайка","Японія"];
?>
<!DOCTYPE HTML>
<html>
<head>
	<title>Lab7</title>
<link rel="stylesheet" type="text/css" href="../style/edit-actor-form-style.css">
</head>
<body>
<a href="../index.php">На головну</a>
<form name='edit-actor' method='post'>
	<div>
		<label for='fullName'>Актор: </label>
		<input type="text" name="fullName" value="<?php echo $data['actor']['fullName']; ?>">
	</div>
	<div>
		<label for='dateOfBirth'>Дата народження: </label>
		<input type="date" name="dateOfBirth" value="<?php echo $data['actor']['dob']; ?>">
	</div>
	<div>
		<label for='placeOfBirth'>Місце народження: </label>
		<select class="form-control" name="placeOfBirth" id="placeOfBirth">
			<option value=""><?php echo $data['actor']['placeOfBirth']; ?></option>
		<?php foreach($countrieS as $placeOfBirth): ?>
			<option value="<?=$placeOfBirth?>"><?=$placeOfBirth?></option>
		<?php endforeach; ?>
		</select>

	</div>
	<div>
		<input type="submit" name="ok" value="змінити">
	</div>
</form>
</body>
</html>